# Лабораторная работа №1
# Контрольные вопросы
1. Какую информацию содержит учётная запись пользователя?
```
 - имя пользователя
 - пароль
```
2. Укажите команды терминала и приведите примеры:
- для получения справки по команде:
```
 команда: man
 пример: man mkdir
```
- для перемещения по файловой системе:
```
 команда: cd
 пример: cd /etc
```
- для просмотра содержимого каталога:
```
команда: ls
пример: ls -l
```
- для определения объёма каталога:
 ```
команда: du
пример: du /etc
``` 
- для создания (удаления) каталогов:
 ```
команда: mkdir (rmdir)
пример: mkdir (rmdir) /doc
```
- для создания (удаления) файлов:
 ```
команда: touch (rm)
пример: touch (rm) list1.txt
``` 
- для задания определённых прав на файл / каталог:
 ```
команда: chmod
пример: chmod g+w list1.txt
``` 
- для просмотра истории команд:
 ```
команда: history
```
3. Что такое файловая система? Приведите примеры с краткой характеристикой.
```
Файловая система – это инструмент, позволяющий управлять системой и программами, обращаясь к нужным файлам и работая с ними. В этой программе используются только название файла, его размер и дата создания.

FAT32 FAT – одна из старых файловых систем, которая была разработана еще в 1977 году программистами компании Microsoft для гибких дисков.

NTFS Структура системы хранения данных имеет вид бинарного дерева. В отличие от иерархической, как в FAT32, доступ к информации осуществляется по запросу, поиск осуществляется по названию файла. В этой системе имеется каталог, отсортированный по названиям. Массив разделен на 2 части и отсек, в котором данный файл не будет, оставшаяся часть также разделена на 2, и так далее до тех пор, пока не будет найден нужный файл.
```
4. Как посмотреть, какие файловые системы подмонтированы в ОС?
```
команда: findmnt
```
5. Как удалить зависший процесс?
```
команда: kill
команда: killall
```
